'''
Задача 2: Найдите сумму цифр трехзначного числа.

Пример:

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
'''

n = int(123)
total = 0
while n > 0:
    x = n % 10
    n //= 10
    total += x
print('Сумма цифр трехзначного числа 123 =', total)

n = int(100)
total = 0
while n > 0:
    x = n % 10
    n //= 10
    total += x
print('Сумма цифр трехзначного числа 100 =', total)