'''
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
'''


name = 'Vasiliy'
name = input('Enter your name:')
print('Name:' + name)

password = 'vas'
password = input('Enter your password:')
print('password:' + password)

age = '45'
age = input('Enter your age:')
print('age:' + age)